# data_loader_api/app/config.py
import os
from dotenv import load_dotenv

# Загружаем переменные окружения из .env файла
# Это позволит получать значения из .env с помощью os.getenv()
load_dotenv()

# Получаем URL базы данных и токен бота из переменных окружения
DATABASE_URL = os.getenv("DATABASE_URL")
TELEGRAM_BOT_TOKEN = os.getenv("TELEGRAM_BOT_TOKEN")

# Проверяем, что важные переменные окружения установлены
if not DATABASE_URL:
    raise ValueError("DATABASE_URL environment variable not set.")
if not TELEGRAM_BOT_TOKEN:
    raise ValueError("TELEGRAM_BOT_TOKEN environment variable not set.")

# ID менеджеров для отправки уведомлений (пример)
# Замени эти ID на реальные ID чатов твоих менеджеров в Telegram
MANAGERS_ID = {
    "Онищенко": 548019148,
    # "Скирда Дмитро Юрійович": 392207160,
    # "Цовма Віктор Станіславович": 979678923,
    # "Гаража Денис Олександрович": 5072996747,
    # "Полівода Антон Сергійович": 811507369,
    # "Шпак Дмитро Юрійович": 1779116530,
    # "Онищенко рабочий": 1060393824,
    # "Чех Олександр Вікторович": 1600296306,
    # "Повар Денис Олексійович": 651394664,
    # "Грязнов Сергей Алексеевич": 919756698,
    # "Шевцов Микола Петрович": 6968050615,
}

# Валидные значения для некоторых полей (пример из твоего кода)
valid_line_of_business = [
    "Власне виробництво насіння",
    "Демо-продукція",
    "ЗЗР",
    "Міндобрива (основні)",
    "Насіння",
    "Позакореневi добрива",
]

valid_warehouse = [
    'Харківський підрозділ  ТОВ "Фірма Ерідон" с.Коротич',
    'Харківський підрозділ  ТОВ "Фірма Ерідон" м.Балаклія',
]